RIET/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС12</name>
    <comment>(Общ) Ставка НДС 12%</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/СтавкиНДС/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;    	
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС, Строка(Перечисления.СтавкиНДС.БезНДС)); 		
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0, Строка(Перечисления.СтавкиНДС.НДС0));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18, Строка(Перечисления.СтавкиНДС.НДС18));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118, Строка(Перечисления.СтавкиНДС.НДС18_118));	
	// { RGS LFedotova 26.04.2017 15:39:45 - вопрос SLI-0007258
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10, Строка(Перечисления.СтавкиНДС.НДС10));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110, Строка(Перечисления.СтавкиНДС.НДС10_110));	
	// } RGS LFedotova 26.04.2017 15:39:51 - вопрос SLI-0007258
	
КонецПроцедуры
